In [ ]:







import pandas as pd
import numpy as np
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN',
'londON_StockhOlm',
'Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})



df

1. Some values in the the FlightNumber column are missing. These numbers are
meant to increase by 10 with each row so 10055 and 10075 need to be put in
place. Fill in these missing numbers and make the column an integer column
(instead of a float column).

In [128]:
val=pd.Series([1045,1055,1065,1075,1085],index=[0,1,2,3,4])
val

0    1045
1    1055
2    1065
3    1075
4    1085
dtype: int64

In [129]:
df['FlightNumber']=val

In [130]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris          1045      [23, 47]               KLM(!)
1      MAdrid_miLAN          1055            []    <Air France> (12)
2  londON_StockhOlm          1065  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis          1075          [13]       12. Air France
4   Brussels_londOn          1085      [67, 32]          "Swiss Air"

2. The From_To column would be better as two separate columns! Split each
string on the underscore delimiter _ to give a new temporary DataFrame with
the correct values. Assign the correct column names to this temporary
DataFrame.

In [131]:
From_To=df["From_To"].str.split("_")

In [132]:
df1=From_To.to_list()

In [133]:
df1

[['LoNDon', 'paris'],
 ['MAdrid', 'miLAN'],
 ['londON', 'StockhOlm'],
 ['Budapest', 'PaRis'],
 ['Brussels', 'londOn']]

In [134]:
names=["From","To"]

In [135]:
names

['From', 'To']

In [136]:
df2=pd.DataFrame(df1,columns=names)

In [137]:
df2

       From         To
0    LoNDon      paris
1    MAdrid      miLAN
2    londON  StockhOlm
3  Budapest      PaRis
4  Brussels     londOn

In [138]:
df[["From","To"]]=df2

In [139]:
df

,From_To,FlightNumber,RecentDelays,Airline,From,To
0,LoNDon_paris,1045,"[23, 47]",KLM(!),LoNDon,paris
1,MAdrid_miLAN,1055,[],<Air France> (12),MAdrid,miLAN
2,londON_StockhOlm,1065,"[24, 43, 87]",(British Airways. ),londON,StockhOlm
3,Budapest_PaRis,1075,[13],12. Air France,Budapest,PaRis
4,Brussels_londOn,1085,"[67, 32]","""Swiss Air""",Brussels,londOn

3. Notice how the capitalisation of the city names is all mixed up in this
temporary DataFrame. Standardise the strings so that only the first letter is
uppercase (e.g. "londON" should become "London".)

In [140]:
df['From']=df['From'].str.capitalize()

In [141]:
df['To']=df['To'].str.capitalize()

In [142]:
df

,From_To,FlightNumber,RecentDelays,Airline,From,To
0,LoNDon_paris,1045,"[23, 47]",KLM(!),London,Paris
1,MAdrid_miLAN,1055,[],<Air France> (12),Madrid,Milan
2,londON_StockhOlm,1065,"[24, 43, 87]",(British Airways. ),London,Stockholm
3,Budapest_PaRis,1075,[13],12. Air France,Budapest,Paris
4,Brussels_londOn,1085,"[67, 32]","""Swiss Air""",Brussels,London

4. Delete the From_To column from df and attach the temporary DataFrame
from the previous questions.

In [143]:
df.drop('From_To',axis=1,inplace=True)

In [145]:
df

   FlightNumber  RecentDelays              Airline      From         To
0          1045      [23, 47]               KLM(!)    London      Paris
1          1055            []    <Air France> (12)    Madrid      Milan
2          1065  [24, 43, 87]  (British Airways. )    London  Stockholm
3          1075          [13]       12. Air France  Budapest      Paris
4          1085      [67, 32]          "Swiss Air"  Brussels     London

5. In the RecentDelays column, the values have been entered into the
DataFrame as a list. We would like each first value in its own column, each 
second value in its own column, and so on. If there isn't an Nth value, the value
should be NaN.

In [144]:
df5=df['RecentDelays'].to_list()

In [146]:
df5

[[23, 47], [], [24, 43, 87], [13], [67, 32]]

In [147]:
df3 = pd.DataFrame(df['RecentDelays'].values.tolist())

In [148]:
df3

      0     1     2
0  23.0  47.0   NaN
1   NaN   NaN   NaN
2  24.0  43.0  87.0
3  13.0   NaN   NaN
4  67.0  32.0   NaN

In [149]:
index=['delay1','delay2','delay3']

In [150]:
df3.columns=index

In [151]:
df3

   delay1  delay2  delay3
0    23.0    47.0     NaN
1     NaN     NaN     NaN
2    24.0    43.0    87.0
3    13.0     NaN     NaN
4    67.0    32.0     NaN

In [152]:
df[["delay1","delay2","delay3"]] = df3[["delay1","delay2","delay3"]]

In [153]:
df

,FlightNumber,RecentDelays,Airline,From,To,delay1,delay2,delay3
0,1045,"[23, 47]",KLM(!),London,Paris,23.0,47.0,NaN
1,1055,[],<Air France> (12),Madrid,Milan,NaN,NaN,NaN
2,1065,"[24, 43, 87]",(British Airways. ),London,Stockholm,24.0,43.0,87.0
3,1075,[13],12. Air France,Budapest,Paris,13.0,NaN,NaN
4,1085,"[67, 32]","""Swiss Air""",Brussels,London,67.0,32.0,NaN

In [154]:
df.drop('RecentDelays',axis=1,inplace=True)

In [155]:
df

,FlightNumber,Airline,From,To,delay1,delay2,delay3
0,1045,KLM(!),London,Paris,23.0,47.0,NaN
1,1055,<Air France> (12),Madrid,Milan,NaN,NaN,NaN
2,1065,(British Airways. ),London,Stockholm,24.0,43.0,87.0
3,1075,12. Air France,Budapest,Paris,13.0,NaN,NaN
4,1085,"""Swiss Air""",Brussels,London,67.0,32.0,NaN